В C# есть 5 типов переменных:
- int - принимает целые значения (числа)
- double - принимает вещественные и целые числа
- char - принимает один символ, значение вписывается в одинарных ('символ') кавычках.
- string - хранит любые символы, слова, предложения, буквы, цифры, пустую строку. Значение вписывается в двойные ("строка") кавычки.
- bool - хранит значения true/false.

**Вывод текста в консоль в C#**
Чтобы вывести текст в консоль без перехода на новую строку, вам нужно использовать Console.Write:
```csharp
Console.Write("Hello, World!");
```
Если всё-таки нужен переход на новую строку:
Вариант 1
```csharp
Console.Write("Hello,\n World!");
```
Вариант 2 (с помощью команды Console.WriteLine, которая выводит текст сразу в новой строке)
```csharp
Console.WriteLine("Hello, World!");
```
*Обратите внимание: обязательно должна присутствовать точка с запятой в конце команды!!!*

Можно вывести текст с переменной:
```csharp
int age = 21;
Console.WriteLine("Мне " + age + "год.");
```

```csharp
string name = "Иван";
string lastname = "Иванов";
Console.WriteLine("Имя: " + name + "\nФамилия:" + lastname);
```

**Ввод текста с клавиатуры**
Часто встречается задача - написать программу, которая спрашивает что-либо у пользователя и сохраняет в определённую переменную. Для этого в C# используется Console.ReadLine
```csharp
Console.Write("Введите ваше имя: ");
string name = Console.ReadLine();
```
ВАЖНО: Console.ReadLine всегда возвращает строку. Если вы спрашиваете какое-либо число, используйте int.Parse или double.Parse (в зависимости от типа переменной):
```csharp
int age = int.Parse(Console.ReadLine());
```

На этом руководство подходит к концу. 

## Теоретические вопросы 
1. Какой тип переменной нужно использовать для хранения числа 3,14?
2. Может ли переменная string хранить числа?
3. С помощью какой команды осуществляется вывод текста в консоль без перехода на новую строку?
4. Как перейти на новую строку?

## Практическая часть
1. Напишите программу, которая три раза выводит на экран "Привет".
2. Напишите программу, которая выводит предложение "Яблоко упало мне на голову", каждое слово с новой строки
3. Создайте переменные name, age, height, которые хранят ваши имя, возраст и рост. Выведите их без перехода на новую строку.